<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Zwift and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.andredb90.pkg.Zwift</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.zwift.ZwiftLauncher</string>
		<key>NAME</key>
		<string>Zwift</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andredb90.download.Zwift</string>
	<key>Process</key>
	<array>
		<dict>
			 <key>Processor</key>
			 <string>PkgCopier</string>
			 <key>Arguments</key>
			 <dict>
					<key>source_pkg</key>
					<string>%pathname%/ZwiftInstaller.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%_%version%.pkg</string>
			 </dict>
		</dict>
	</array>
</dict>
</plist>
