<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of 3CX and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.andredb90.filewave.3CX</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.michalmmac.download.3CX</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>3CXPhone</string>
        <key>fw_app_bundle_id</key>
        <string>3cxphone14</string>
        <key>fw_destination_root</key>
        <string>/Applications/3CXPhone.app</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
				</dict>
<key>Processor</key>
<string>AppDmgVersioner</string>
</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/3CXPhone.app</string>
				<key>source_path</key>
				<string>%pathname%/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
        <string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/3CXPhone.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
