<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Nextcloud.</string>
	<key>Identifier</key>
	<string>com.github.andredb90.download.Nextcloud</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Nextcloud</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://nextcloud.com/install/</string>
						<key>re_pattern</key>
						<string>(\/\S*.pkg)</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>https:%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			</dict>
	</array>
</dict>
</plist>
