<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Aircall Workspace.

To download Apple Silicon use: "arm64" in the DOWNLOAD_ARCH variable
To download Intel use: "x64" in the DOWNLOAD_ARCH variable</string>
	<key>Identifier</key>
	<string>com.github.andredb90.pkg.Aircall Workspace</string>
	<key>Input</key>
	<dict>
        <key>DOWNLOAD_ARCH</key>
        <string>arm64</string>
        <key>NAME</key>
        <string>AircallWorkspace</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Aircall Workspace</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
