<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SecureSafe.</string>
	<key>Identifier</key>
	<string>com.github.andredb90.download.securesafe</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SecureSafe</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.securesafe.com/de/downloads/</string>
				<key>re_pattern</key>
				<string>(\/\S*.pkg)</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: DSwiss Ltd. (U8DL7XVP69)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/unpacked</string>
			<key>flat_pkg_path</key>
			<string>%pathname%</string>
		</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/expanded</string>
			<key>pkg_payload_path</key>
			<string>%RECIPE_CACHE_DIR%/unpacked/Core.pkg/payload</string>
			<key>purge_destination</key>
			<true/>
		</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
		<dict>
			<key>pattern</key>
			<string>%RECIPE_CACHE_DIR%/expanded/SecureSafe*.app/Contents/Info.plist</string>
		</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>%found_filename%</string>
			<key>plist_version_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
