<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of the node.js installer package and imports it into FileWave. (Use RELEASE "latest-dubnium" in your override for latest version)</string>
    <key>Identifier</key>
    <string>com.github.andreDB90.filewave.node</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>node</string>
        <key>fw_app_bundle_id</key>
	<string>com.github.andreDB90.filewave.node</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.download.node</string>
    <key>Process</key>
    <array>
  		<dict>
  			<key>Arguments</key>
  			<dict>
         			<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
  				<key>fw_app_version</key>
  				<string>%version%</string>
  				<key>fw_fileset_name</key>
  				<string>%NAME% - %version%</string>
  				<key>fw_import_source</key>
  				<string>%pathname%</string>
  			</dict>
  			<key>Processor</key>
  			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
  		</dict>
  	</array>
</dict>
</plist>
