<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ProtonVPN, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.andredb90.filewave.ProtonVPN</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ProtonVPN</string>
		<key>fw_app_bundle_id</key>
        <string>ch.protonvpn.mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andredb90.pkg.ProtonVPN</string>
	<key>Process</key>
    <array>
  		<dict>
  		  <key>Arguments</key>
  		  <dict>
       	  <key>fw_app_bundle_id</key>
          <string>%fw_app_bundle_id%</string>
          <key>fw_app_version</key>
          <string>%version%</string>
          <key>fw_fileset_name</key>
          <string>%NAME% - %version%</string>
          <key>fw_import_source</key>
          <string>%pkg_path%</string>
  		  </dict>
  			<key>Processor</key>
  			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
  		  </dict>
	</array>
</dict>
</plist>
