<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft's Teams installer package and imports it into FileWave.</string>
    <key>Identifier</key>
    <string>com.github.andredb90.filewave.microsoftteams</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Teams</string>
        <key>fw_app_bundle_id</key>
	<string>com.microsoft.teams</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.microsoftteams</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is now non-functional. Please remove it from your list of recipes. Microsoft introduced changes to the Teams app name, so I'm retiring this recipe until it becomes clear what Microsoft is doing here. I am deprecating this recipe and adding a StopProcessingIf step to prevent it from running.</string>
            </dict>
        </dict>
  	<dict>
  		<key>Arguments</key>
  		<dict>
      			<key>fw_app_bundle_id</key>
		  	<string>%fw_app_bundle_id%</string>
			<key>fw_app_version</key>
  			<string>%version%</string>
  			<key>fw_fileset_name</key>
  			<string>%NAME% - %version%</string>
  			<key>fw_import_source</key>
  			<string>%pkg_path%</string>
  		</dict>
  		<key>Processor</key>
  		<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
  	</dict>
	</array>
</dict>
</plist>
